sdaiPutAttrBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,SdaiPrimitiveType,BTEllipsis)
\details
Set a new value of the application instance attribute.
\param instance      [in] An instance that contains the attribute.
\param attributeName [in] A string that contains the name of the attribute.
\param valueType     [in] A value data type.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiEI_NEXS - Instance does not exist.
* sdaiAT_NDEF - Attribute not defined.
* sdaiVT_NVLD - Value type invalid.
* sdaiAT_NVLD - Attribute invalid.
* sdaiSY_ERR - Underlying system error.
\code
SdaiAppInstance readWriteAppInstance138 = ...;
SdaiString newGlobalId = "1234567890123456789012";
sdaiPutAttrBN(readWriteAppInstance138, "globalid", sdaiSTRING, newGlobalId);
...